Continued plan output from previous comment.
<details><summary>Show Output</summary>

```diff
 hidden)

        # (2 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-deidentifyFiles.aws_iam_role_policy.additional_json[0] will be updated in-place
  ~ resource "aws_iam_role_policy" "additional_json" {
        id          = "sbeacon-backend-deidentifyFiles:sbeacon-backend-deidentifyFiles"
        name        = "sbeacon-backend-deidentifyFiles"
      ~ policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "s3:ListBucket"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::gaspi-dataportal20250521064203402700000004"
                    },
                  - {
                      - Action   = [
                          - "s3:HeadObject",
                          - "s3:GetObject",
                          - "s3:DeleteObject",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::gaspi-dataportal20250521064203402700000004/staging/projects/*/project-files/*"
                    },
                  - {
                      - Action   = "s3:PutObject"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::gaspi-dataportal20250521064203402700000004/projects/*/project-files/*"
                    },
                  - {
                      - Action   = "dynamodb:UpdateItem"
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:dynamodb:ap-southeast-3:727260606489:table/sbeacon-vcfs",
                          - "arn:aws:dynamodb:ap-southeast-3:727260606489:table/sbeacon-dataportal-projects",
                        ]
                    },
                  - {
                      - Action   = [
                          - "ec2:RunInstances",
                          - "ec2:DescribeInstances",
                          - "ec2:DescribeImages",
                          - "ec2:CreateTags",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                  - {
                      - Action   = "iam:PassRole"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:iam::727260606489:role/sbeacon_backend_ec2_deidentification_instance_role"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.sbeacon.module.lambda-deidentifyFiles.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
      ~ filename                       = "builds/76e86e3e11a69ecc9f0725dfa1c155d60ad9da3230a6e2e7bf443cd739a38e49.zip" -> "builds/5a6513a124539d405e198f8b667d222b031442e312b7167506d63dc12fb79547.zip"
        id                             = "sbeacon-backend-deidentifyFiles"
      ~ last_modified                  = "2025-07-15T02:17:09.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:727260606489:layer:sbeacon_backend_python_libraries_layer:6",
          - "arn:aws:lambda:ap-southeast-3:727260606489:layer:sbeacon_backend_python_modules_layer:5",
          - "arn:aws:lambda:ap-southeast-3:727260606489:layer:sbeacon_backend_binaries_layer:5",
        ] -> (known after apply)
      ~ tags                           = {
          ~ "Environment"           = "dev" -> "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
      ~ tags_all                       = {
          ~ "Environment"           = "dev" -> "uat"
            # (3 unchanged elements hidden)
        }
        # (25 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-deidentifyFiles.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "sbeacon/lambda/deidentifyFiles",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/5a6513a124539d405e198f8b667d222b031442e312b7167506d63dc12fb79547.zip"
              + runtime       = "python3.12"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/5a6513a124539d405e198f8b667d222b031442e312b7167506d63dc12fb79547.plan.json"
      + id                   = (known after apply)
    }

  # module.sbeacon.module.lambda-deidentifyFiles.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "7809955352808484213" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/76e86e3e11a69ecc9f0725dfa1c155d60ad9da3230a6e2e7bf443cd739a38e49.zip" -> "builds/5a6513a124539d405e198f8b667d222b031442e312b7167506d63dc12fb79547.zip"
          ~ "timestamp" = "1751333888878681000" -> "1754386121354929000"
        }
    }

  # module.sbeacon.module.lambda-generateCohortVCfs.aws_cloudwatch_log_group.lambda[0] will be updated in-place
  ~ resource "aws_cloudwatch_log_group" "lambda" {
        id                = "/aws/lambda/sbeacon-backend-generateCohortVCfs"
        name              = "/aws/lambda/sbeacon-backend-generateCohortVCfs"
      ~ tags              = {
          ~ "Environment" = "dev" -> "uat"
            "NAME"        = "sbeacon-backend"
            "Owner"       = "gaspi"
        }
      ~ tags_all          = {
          ~ "Environment" = "dev" -> "uat"
            # (2 unchanged elements hidden)
        }
        # (7 unchanged attributes hidden)
    }

  # module.sbeacon.module.lambda-generateCohortVCfs.aws_iam_role.lambda[0] will be updated in-place
  ~ resource "aws_iam_role" "lambda" {
        id                    = "sbeacon-backend-generateCohortVCfs"
        name                  = "sbeacon-backend-generateCohortVCfs"
      ~ tags                  = {
          ~ "Environment" = "dev" -> "uat"
            "NAME"        = "sbeacon-backend"
            "Owner"       = "gaspi"
        }
      ~ tags_all              = {
          ~ "Environment" = "dev" -> "uat"
            # (2 unchanged elements hidden)
        }
        # (11 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-generateCohortVCfs.aws_iam_role_policy.additional_jsons[1] will be updated in-place
  ~ resource "aws_iam_role_policy" "additional_jsons" {
        id          = "sbeacon-backend-generateCohortVCfs:sbeacon-backend-generateCohortVCfs-1"
        name        = "sbeacon-backend-generateCohortVCfs-1"
      ~ policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "athena:StartQueryExecution",
                          - "athena:GetQueryResults",
                          - "athena:GetQueryExecution",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:athena:ap-southeast-3:727260606489:workgroup/query_workgroup"
                    },
                  - {
                      - Action   = "glue:*"
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                  - {
                      - Action   = "s3:*"
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:s3:::gaspi-metadata20250521064201492000000003/*",
                          - "arn:aws:s3:::gaspi-metadata20250521064201492000000003",
                        ]
                    },
                  - {
                      - Action   = "dynamodb:Query"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:dynamodb:ap-southeast-3:727260606489:table/sbeacon-dataportal-project-users/index/uid-index"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.sbeacon.module.lambda-generateCohortVCfs.aws_iam_role_policy.additional_jsons[2] will be updated in-place
  ~ resource "aws_iam_role_policy" "additional_jsons" {
        id          = "sbeacon-backend-generateCohortVCfs:sbeacon-backend-generateCohortVCfs-2"
        name        = "sbeacon-backend-generateCohortVCfs-2"
      ~ policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "dynamodb:Scan",
                          - "dynamodb:GetItem",
                          - "dynamodb:DescribeTable",
                          - "dynamodb:BatchGetItem",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:dynamodb:ap-southeast-3:727260606489:table/sbeacon-Ontologies",
                          - "arn:aws:dynamodb:ap-southeast-3:727260606489:table/sbeacon-Descendants",
                          - "arn:aws:dynamodb:ap-southeast-3:727260606489:table/sbeacon-Anscestors",
                        ]
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.sbeacon.module.lambda-generateCohortVCfs.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-generateCohortVCfs"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:727260606489:layer:sbeacon_backend_python_libraries_layer:6",
          - "arn:aws:lambda:ap-southeast-3:727260606489:layer:sbeacon_backend_python_modules_layer:5",
          - "arn:aws:lambda:ap-southeast-3:727260606489:layer:sbeacon_backend_binaries_layer:5",
        ] -> (known after apply)
      ~ tags                           = {
          ~ "Environment"           = "dev" -> "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
      ~ tags_all                       = {
          ~ "Environment"           = "dev" -> "uat"
            # (3 unchanged elements hidden)
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-generateCohortVCfs.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "5624607913122667411" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1747809668530170000" -> "1754386121385103000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-generateReports.aws_cloudwatch_log_group.lambda[0] will be updated in-place
  ~ resource "aws_cloudwatch_log_group" "lambda" {
        id                = "/aws/lambda/sbeacon-backend-generateReports"
        name              = "/aws/lambda/sbeacon-backend-generateReports"
      ~ tags              = {
          ~ "Environment" = "dev" -> "uat"
            "NAME"        = "sbeacon-backend"
            "Owner"       = "gaspi"
        }
      ~ tags_all          = {
          ~ "Environment" = "dev" -> "uat"
            # (2 unchanged elements hidden)
        }
        # (7 unchanged attributes hidden)
    }

  # module.sbeacon.module.lambda-generateReports.aws_iam_role.lambda[0] will be updated in-place
  ~ resource "aws_iam_role" "lambda" {
        id                    = "sbeacon-backend-generateReports"
        name                  = "sbeacon-backend-generateReports"
      ~ tags                  = {
          ~ "Environment" = "dev" -> "uat"
            "NAME"        = "sbeacon-backend"
            "Owner"       = "gaspi"
        }
      ~ tags_all              = {
          ~ "Environment" = "dev" -> "uat"
            # (2 unchanged elements hidden)
        }
        # (11 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-generateReports.aws_iam_role_policy.additional_jsons[0] will be updated in-place
  ~ resource "aws_iam_role_policy" "additional_jsons" {
        id          = "sbeacon-backend-generateReports:sbeacon-backend-generateReports-0"
        name        = "sbeacon-backend-generateReports-0"
      ~ policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "dynamodb:Scan",
                          - "dynamodb:Query",
                          - "dynamodb:GetItem",
                          - "dynamodb:DescribeTable",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:dynamodb:ap-southeast-3:727260606489:table/svep-references"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.sbeacon.module.lambda-generateReports.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
      ~ filename                       = "builds/a25961aa8739ce66a24225e5eb4e93f5109290ea8f672e5a1dba7246e9750722.zip" -> "builds/0300e75b7f536502cf4a1de5308dcfa7fc3b7756791a2ad0c7579e34a8fcf036.zip"
        id                             = "sbeacon-backend-generateReports"
      ~ last_modified                  = "2025-07-15T02:15:17.000+0000" -> (known after apply)
      ~ tags                           = {
          ~ "Environment"           = "dev" -> "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
      ~ tags_all                       = {
          ~ "Environment"           = "dev" -> "uat"
            # (3 unchanged elements hidden)
        }
        # (26 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              + "DPORTAL_BUCKET"               = "gaspi-dataportal20250521064203402700000004"
                # (1 unchanged element hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-generateReports.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "pip",
                          + "python3.12",
                          + "sbeacon/lambda/generateReports/requirements.txt",
                          + null,
                          + null,
                        ],
                      + [
                          + "zip",
                          + "sbeacon/lambda/generateReports",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/0300e75b7f536502cf4a1de5308dcfa7fc3b7756791a2ad0c7579e34a8fcf036.zip"
              + runtime       = "python3.12"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/0300e75b7f536502cf4a1de5308dcfa7fc3b7756791a2ad0c7579e34a8fcf036.plan.json"
      + id                   = (known after apply)
    }

  # module.sbeacon.module.lambda-generateReports.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "5031679036035905822" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/a25961aa8739ce66a24225e5eb4e93f5109290ea8f672e5a1dba7246e9750722.zip" -> "builds/0300e75b7f536502cf4a1de5308dcfa7fc3b7756791a2ad0c7579e34a8fcf036.zip"
          ~ "timestamp" = "1751333889445265000" -> "1754386121775921200"
        }
    }

  # module.sbeacon.module.lambda-getAnalyses.aws_cloudwatch_log_group.lambda[0] will be updated in-place
  ~ resource "aws_cloudwatch_log_group" "lambda" {
        id                = "/aws/lambda/sbeacon-backend-getAnalyses"
        name              = "/aws/lambda/sbeacon-backend-getAnalyses"
      ~ tags              = {
          ~ "Environment" = "dev" -> "uat"
            "NAME"        = "sbeacon-backend"
            "Owner"       = "gaspi"
        }
      ~ tags_all          = {
          ~ "Environment" = "dev" -> "uat"
            # (2 unchanged elements hidden)
        }
        # (7 unchanged attributes hidden)
    }

  # module.sbeacon.module.lambda-getAnalyses.aws_iam_role.lambda[0] will be updated in-place
  ~ resource "aws_iam_role" "lambda" {
        id                    = "sbeacon-backend-getAnalyses"
        name                  = "sbeacon-backend-getAnalyses"
      ~ tags                  = {
          ~ "Environment" = "dev" -> "uat"
            "NAME"        = "sbeacon-backend"
            "Owner"       = "gaspi"
        }
      ~ tags_all              = {
          ~ "Environment" = "dev" -> "uat"
            # (2 unchanged elements hidden)
        }
        # (11 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getAnalyses.aws_iam_role_policy.additional_jsons[0] will be updated in-place
  ~ resource "aws_iam_role_policy" "additional_jsons" {
        id          = "sbeacon-backend-getAnalyses:sbeacon-backend-getAnalyses-0"
        name        = "sbeacon-backend-getAnalyses-0"
      ~ policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "s3:ListBucket",
                          - "s3:GetObject",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                  - {
                      - Action   = "lambda:InvokeFunction"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:lambda:ap-southeast-3:727260606489:function:sbeacon-backend-splitQuery"
                    },
                  - {
                      - Action   = "SNS:Publish"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:sns:ap-southeast-3:727260606489:splitQuery"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.sbeacon.module.lambda-getAnalyses.aws_iam_role_policy.additional_jsons[1] will be updated in-place
  ~ resource "aws_iam_role_policy" "additional_jsons" {
        id          = "sbeacon-backend-getAnalyses:sbeacon-backend-getAnalyses-1"
        name        = "sbeacon-backend-getAnalyses-1"
      ~ policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "athena:StartQueryExecution",
                          - "athena:GetQueryResults",
                          - "athena:GetQueryExecution",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:athena:ap-southeast-3:727260606489:workgroup/query_workgroup"
                    },
                  - {
                      - Action   = "glue:*"
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                  - {
                      - Action   = "s3:*"
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:s3:::gaspi-metadata20250521064201492000000003/*",
                          - "arn:aws:s3:::gaspi-metadata20250521064201492000000003",
                        ]
                    },
                  - {
                      - Action   = "dynamodb:Query"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:dynamodb:ap-southeast-3:727260606489:table/sbeacon-dataportal-project-users/index/uid-index"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.sbeacon.module.lambda-getAnalyses.aws_iam_role_policy.additional_jsons[2] will be updated in-place
  ~ resource "aws_iam_role_policy" "additional_jsons" {
        id          = "sbeacon-backend-getAnalyses:sbeacon-backend-getAnalyses-2"
        name        = "sbeacon-backend-getAnalyses-2"
      ~ policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "dynamodb:Scan",
                          - "dynamodb:GetItem",
                          - "dynamodb:DescribeTable",
                          - "dynamodb:BatchGetItem",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:dynamodb:ap-southeast-3:727260606489:table/sbeacon-Ontologies",
                          - "arn:aws:dynamodb:ap-southeast-3:727260606489:table/sbeacon-Descendants",
                          - "arn:aws:dynamodb:ap-southeast-3:727260606489:table/sbeacon-Anscestors",
                        ]
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.sbeacon.module.lambda-getAnalyses.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getAnalyses"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:727260606489:layer:sbeacon_backend_python_libraries_layer:6",
          - "arn:aws:lambda:ap-southeast-3:727260606489:layer:sbeacon_backend_python_modules_layer:5",
        ] -> (known after apply)
      ~ tags                           = {
          ~ "Environment"           = "dev" -> "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
      ~ tags_all                       = {
          ~ "Environment"           = "dev" -> "uat"
            # (3 unchanged elements hidden)
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getAnalyses.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "3082812697153647896" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1751931360028662000" -> "1754386120658050000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-getBiosamples.aws_cloudwatch_log_group.lambda[0] will be updated in-place
  ~ resource "aws_cloudwatch_log_group" "lambda" {
        id                = "/aws/lambda/sbeacon-backend-getBiosamples"
        name              = "/aws/lambda/sbeacon-backend-getBiosamples"
      ~ tags              = {
          ~ "Environment" = "dev" -> "uat"
            "NAME"        = "sbeacon-backend"
            "Owner"       = "gaspi"
        }
      ~ tags_all          = {
          ~ "Environment" = "dev" -> "uat"
            # (2 unchanged elements hidden)
        }
        # (7 unchanged attributes hidden)
    }

  # module.sbeacon.module.lambda-getBiosamples.aws_iam_role.lambda[0] will be updated in-place
  ~ resource "aws_iam_role" "lambda" {
        id                    = "sbeacon-backend-getBiosamples"
        name                  = "sbeacon-backend-getBiosamples"
      ~ tags                  = {
          ~ "Environment" = "dev" -> "uat"
            "NAME"        = "sbeacon-backend"
            "Owner"       = "gaspi"
        }
      ~ tags_all              = {
          ~ "Environment" = "dev" -> "uat"
            # (2 unchanged elements hidden)
        }
        # (11 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getBiosamples.aws_iam_role_policy.additional_jsons[0] will be updated in-place
  ~ resource "aws_iam_role_policy" "additional_jsons" {
        id          = "sbeacon-backend-getBiosamples:sbeacon-backend-getBiosamples-0"
        name        = "sbeacon-backend-getBiosamples-0"
      ~ policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "s3:ListBucket",
                          - "s3:GetObject",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                  - {
                      - Action   = "lambda:InvokeFunction"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:lambda:ap-southeast-3:727260606489:function:sbeacon-backend-splitQuery"
                    },
                  - {
                      - Action   = "SNS:Publish"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:sns:ap-southeast-3:727260606489:splitQuery"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.sbeacon.module.lambda-getBiosamples.aws_iam_role_policy.additional_jsons[1] will be updated in-place
  ~ resource "aws_iam_role_policy" "additional_jsons" {
        id          = "sbeacon-backend-getBiosamples:sbeacon-backend-getBiosamples-1"
        name        = "sbeacon-backend-getBiosamples-1"
      ~ policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "athena:StartQueryExecution",
                          - "athena:GetQueryResults",
                          - "athena:GetQueryExecution",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:athena:ap-southeast-3:727260606489:workgroup/query_workgroup"
                    },
                  - {
                      - Action   = "glue:*"
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                  - {
                      - Action   = "s3:*"
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:s3:::gaspi-metadata20250521064201492000000003/*",
                          - "arn:aws:s3:::gaspi-metadata20250521064201492000000003",
                        ]
                    },
                  - {
                      - Action   = "dynamodb:Query"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:dynamodb:ap-southeast-3:727260606489:table/sbeacon-dataportal-project-users/index/uid-index"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.sbeacon.module.lambda-getBiosamples.aws_iam_role_policy.additional_jsons[2] will be updated in-place
  ~ resource "aws_iam_role_policy" "additional_jsons" {
        id          = "sbeacon-backend-getBiosamples:sbeacon-backend-getBiosamples-2"
        name        = "sbeacon-backend-getBiosamples-2"
      ~ policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "dynamodb:Scan",
                          - "dynamodb:GetItem",
                          - "dynamodb:DescribeTable",
                          - "dynamodb:BatchGetItem",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:dynamodb:ap-southeast-3:727260606489:table/sbeacon-Ontologies",
                          - "arn:aws:dynamodb:ap-southeast-3:727260606489:table/sbeacon-Descendants",
                          - "arn:aws:dynamodb:ap-southeast-3:727260606489:table/sbeacon-Anscestors",
                        ]
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.sbeacon.module.lambda-getBiosamples.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getBiosamples"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:727260606489:layer:sbeacon_backend_python_libraries_layer:6",
          - "arn:aws:lambda:ap-southeast-3:727260606489:layer:sbeacon_backend_python_modules_layer:5",
        ] -> (known after apply)
      ~ tags                           = {
          ~ "Environment"           = "dev" -> "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
      ~ tags_all                       = {
          ~ "Environment"           = "dev" -> "uat"
            # (3 unchanged elements hidden)
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getBiosamples.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "6081411913434621073" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1751931350805468000" -> "1754386120233627000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-getConfiguration.aws_cloudwatch_log_group.lambda[0] will be updated in-place
  ~ resource "aws_cloudwatch_log_group" "lambda" {
        id                = "/aws/lambda/sbeacon-backend-getConfiguration"
        name              = "/aws/lambda/sbeacon-backend-getConfiguration"
      ~ tags              = {
          ~ "Environment" = "dev" -> "uat"
            "NAME"        = "sbeacon-backend"
            "Owner"       = "gaspi"
        }
      ~ tags_all          = {
          ~ "Environment" = "dev" -> "uat"
            # (2 unchanged elements hidden)
        }
        # (7 unchanged attributes hidden)
    }

  # module.sbeacon.module.lambda-getConfiguration.aws_iam_role.lambda[0] will be updated in-place
  ~ resource "aws_iam_role" "lambda" {
        id                    = "sbeacon-backend-getConfiguration"
        name                  = "sbeacon-backend-getConfiguration"
      ~ tags                  = {
          ~ "Environment" = "dev" -> "uat"
            "NAME"        = "sbeacon-backend"
            "Owner"       = "gaspi"
        }
      ~ tags_all              = {
          ~ "Environment" = "dev" -> "uat"
            # (2 unchanged elements hidden)
        }
        # (11 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.sbeacon.module.lambda-getConfiguration.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getConfiguration"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:727260606489:layer:sbeacon_backend_python_libraries_layer:6",
          - "arn:aws:lambda:ap-southeast-3:727260606489:layer:sbeacon_backend_python_modules_layer:5",
        ] -> (known after apply)
      ~ tags                           = {
          ~ "Environment"           = "dev" -> "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
      ~ tags_all                       = {
          ~ "Environment"           = "dev" -> "uat"
            # (3 unchanged elements hidden)
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getConfiguration.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "6744482225658526142" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1747809668082257000" -> "1754386121220352800"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-getDatasets.aws_cloudwatch_log_group.lambda[0] will be updated in-place
  ~ resource "aws_cloudwatch_log_group" "lambda" {
        id                = "/aws/lambda/sbeacon-backend-getDatasets"
        name              = "/aws/lambda/sbeacon-backend-getDatasets"
      ~ tags              = {
          ~ "Environment" = "dev" -> "uat"
            "NAME"        = "sbeacon-backend"
            "Owner"       = "gaspi"
        }
      ~ tags_all          = {
          ~ "Environment" = "dev" -> "uat"
            # (2 unchanged elements hidden)
        }
        # (7 unchanged attributes hidden)
    }

  # module.sbeacon.module.lambda-getDatasets.aws_iam_role.lambda[0] will be updated in-place
  ~ resource "aws_iam_role" "lambda" {
        id                    = "sbeacon-backend-getDatasets"
        name                  = "sbeacon-backend-getDatasets"
      ~ tags                  = {
          ~ "Environment" = "dev" -> "uat"
            "NAME"        = "sbeacon-backend"
            "Owner"       = "gaspi"
        }
      ~ tags_all              = {
          ~ "Environment" = "dev" -> "uat"
            # (2 unchanged elements hidden)
        }
        # (11 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getDatasets.aws_iam_role_policy.additional_jsons[0] will be updated in-place
  ~ resource "aws_iam_role_policy" "additional_jsons" {
        id          = "sbeacon-backend-getDatasets:sbeacon-backend-getDatasets-0"
        name        = "sbeacon-backend-getDatasets-0"
      ~ policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "s3:ListBucket",
                          - "s3:GetObject",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                  - {
                      - Action   = "lambda:InvokeFunction"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:lambda:ap-southeast-3:727260606489:function:sbeacon-backend-splitQuery"
                    },
                  - {
                      - Action   = "SNS:Publish"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:sns:ap-southeast-3:727260606489:splitQuery"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.sbeacon.module.lambda-getDatasets.aws_iam_role_policy.additional_jsons[1] will be updated in-place
  ~ resource "aws_iam_role_policy" "additional_jsons" {
        id          = "sbeacon-backend-getDatasets:sbeacon-backend-getDatasets-1"
        name        = "sbeacon-backend-getDatasets-1"
      ~ policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "athena:StartQueryExecution",
                          - "athena:GetQueryResults",
                          - "athena:GetQueryExecution",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:athena:ap-southeast-3:727260606489:workgroup/query_workgroup"
                    },
                  - {
                      - Action   = "glue:*"
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                  - {
                      - Action   = "s3:*"
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:s3:::gaspi-metadata20250521064201492000000003/*",
                          - "arn:aws:s3:::gaspi-metadata20250521064201492000000003",
                        ]
                    },
                  - {
                      - Action   = "dynamodb:Query"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:dynamodb:ap-southeast-3:727260606489:table/sbeacon-dataportal-project-users/index/uid-index"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.sbeacon.module.lambda-getDatasets.aws_iam_role_policy.additional_jsons[2] will be updated in-place
  ~ resource "aws_iam_role_policy" "additional_jsons" {
        id          = "sbeacon-backend-getDatasets:sbeacon-backend-getDatasets-2"
        name        = "sbeacon-backend-getDatasets-2"
      ~ policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "dynamodb:Scan",
                          - "dynamodb:GetItem",
                          - "dynamodb:DescribeTable",
                          - "dynamodb:BatchGetItem",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:dynamodb:ap-southeast-3:727260606489:table/sbeacon-Ontologies",
                          - "arn:aws:dynamodb:ap-southeast-3:727260606489:table/sbeacon-Descendants",
                          - "arn:aws:dynamodb:ap-southeast-3:727260606489:table/sbeacon-Anscestors",
                        ]
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.sbeacon.module.lambda-getDatasets.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
      ~ filename                       = "builds/74827b7c33367c85a24bbc7acb24a868b79c62e1bfdcca1014bc6aac52aa0f44.zip" -> "builds/997881b464fbee165bfd7f3775f7cf4e4938513ecf4950a359d57af93c31bdbd.zip"
        id                             = "sbeacon-backend-getDatasets"
      ~ last_modified                  = "2025-07-15T02:18:07.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:727260606489:layer:sbeacon_backend_python_libraries_layer:6",
          - "arn:aws:lambda:ap-southeast-3:727260606489:layer:sbeacon_backend_python_modules_layer:5",
        ] -> (known after apply)
      ~ tags                           = {
          ~ "Environment"           = "dev" -> "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
      ~ tags_all                       = {
          ~ "Environment"           = "dev" -> "uat"
            # (3 unchanged elements hidden)
        }
        # (25 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getDatasets.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "sbeacon/lambda/getDatasets",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/997881b464fbee165bfd7f3775f7cf4e4938513ecf4950a359d57af93c31bdbd.zip"
              + runtime       = "python3.12"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/997881b464fbee165bfd7f3775f7cf4e4938513ecf4950a359d57af93c31bdbd.plan.json"
      + id                   = (known after apply)
    }

  # module.sbeacon.module.lambda-getDatasets.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "3411117659946867846" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/74827b7c33367c85a24bbc7acb24a868b79c62e1bfdcca1014bc6aac52aa0f44.zip" -> "builds/997881b464fbee165bfd7f3775f7cf4e4938513ecf4950a359d57af93c31bdbd.zip"
          ~ "timestamp" = "1751931363807328000" -> "1754386120822455800"
        }
    }

  # module.sbeacon.module.lambda-getEntryTypes.aws_cloudwatch_log_group.lambda[0] will be updated in-place
  ~ resource "aws_cloudwatch_log_group" "lambda" {
        id                = "/aws/lambda/sbeacon-backend-getEntryTypes"
        name              = "/aws/lambda/sbeacon-backend-getEntryTypes"
      ~ tags              = {
          ~ "Environment" = "dev" -> "uat"
            "NAME"        = "sbeacon-backend"
            "Owner"       = "gaspi"
        }
      ~ tags_all          = {
          ~ "Environment" = "dev" -> "uat"
            # (2 unchanged elements hidden)
        }
        # (7 unchanged attributes hidden)
    }

  # module.sbeacon.module.lambda-getEntryTypes.aws_iam_role.lambda[0] will be updated in-place
  ~ resource "aws_iam_role" "lambda" {
        id                    = "sbeacon-backend-getEntryTypes"
        name                  = "sbeacon-backend-getEntryTypes"
      ~ tags                  = {
          ~ "Environment" = "dev" -> "uat"
            "NAME"        = "sbeacon-backend"
            "Owner"       = "gaspi"
        }
      ~ tags_all              = {
          ~ "Environment" = "dev" -> "uat"
            # (2 unchanged elements hidden)
        }
        # (11 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.sbeacon.module.lambda-getEntryTypes.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getEntryTypes"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:727260606489:layer:sbeacon_backend_python_libraries_layer:6",
          - "arn:aws:lambda:ap-southeast-3:727260606489:layer:sbeacon_backend_python_modules_layer:5",
        ] -> (known after apply)
      ~ tags                           = {
          ~ "Environment"           = "dev" -> "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
      ~ tags_all                       = {
          ~ "Environment"           = "dev" -> "uat"
            # (3 unchanged elements hidden)
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getEntryTypes.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "1332831728792654893" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1747809668083036800" -> "1754386120531550800"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-getFilteringTerms.aws_cloudwatch_log_group.lambda[0] will be updated in-place
  ~ resource "aws_cloudwatch_log_group" "lambda" {
        id                = "/aws/lambda/sbeacon-backend-getFilteringTerms"
        name              = "/aws/lambda/sbeacon-backend-getFilteringTerms"
      ~ tags              = {
          ~ "Environment" = "dev" -> "uat"
            "NAME"        = "sbeacon-backend"
            "Owner"       = "gaspi"
        }
      ~ tags_all          = {
          ~ "Environment" = "dev" -> "uat"
            # (2 unchanged elements hidden)
        }
        # (7 unchanged attributes hidden)
    }

  # module.sbeacon.module.lambda-getFilteringTerms.aws_iam_role.lambda[0] will be updated in-place
  ~ resource "aws_iam_role" "lambda" {
        id                    = "sbeacon-backend-getFilteringTerms"
        name                  = "sbeacon-backend-getFilteringTerms"
      ~ tags                  = {
          ~ "Environment" = "dev" -> "uat"
            "NAME"        = "sbeacon-backend"
            "Owner"       = "gaspi"
        }
      ~ tags_all              = {
          ~ "Environment" = "dev" -> "uat"
            # (2 unchanged elements hidden)
        }
        # (11 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getFilteringTerms.aws_iam_role_policy.additional_jsons[0] will be updated in-place
  ~ resource "aws_iam_role_policy" "additional_jsons" {
        id          = "sbeacon-backend-getFilteringTerms:sbeacon-backend-getFilteringTerms-0"
        name        = "sbeacon-backend-getFilteringTerms-0"
      ~ policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "athena:StartQueryExecution",
                          - "athena:GetQueryResults",
                          - "athena:GetQueryExecution",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:athena:ap-southeast-3:727260606489:workgroup/query_workgroup"
                    },
                  - {
                      - Action   = "glue:*"
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                  - {
                      - Action   = "s3:*"
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:s3:::gaspi-metadata20250521064201492000000003/*",
                          - "arn:aws:s3:::gaspi-metadata20250521064201492000000003",
                        ]
                    },
                  - {
                      - Action   = "dynamodb:Query"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:dynamodb:ap-southeast-3:727260606489:table/sbeacon-dataportal-project-users/index/uid-index"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.sbeacon.module.lambda-getFilteringTerms.aws_iam_role_policy.additional_jsons[1] will be updated in-place
  ~ resource "aws_iam_role_policy" "additional_jsons" {
        id          = "sbeacon-backend-getFilteringTerms:sbeacon-backend-getFilteringTerms-1"
        name        = "sbeacon-backend-getFilteringTerms-1"
      ~ policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "dynamodb:Scan",
                          - "dynamodb:GetItem",
                          - "dynamodb:DescribeTable",
                          - "dynamodb:BatchGetItem",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:dynamodb:ap-southeast-3:727260606489:table/sbeacon-Ontologies",
                          - "arn:aws:dynamodb:ap-southeast-3:727260606489:table/sbeacon-Descendants",
                          - "arn:aws:dynamodb:ap-southeast-3:727260606489:table/sbeacon-Anscestors",
                        ]
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.sbeacon.module.lambda-getFilteringTerms.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getFilteringTerms"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:727260606489:layer:sbeacon_backend_python_libraries_layer:6",
          - "arn:aws:lambda:ap-southeast-3:727260606489:layer:sbeacon_backend_python_modules_layer:5",
        ] -> (known after apply)
      ~ tags                           = {
          ~ "Environment"           = "dev" -> "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
      ~ tags_all                       = {
          ~ "Environment"           = "dev" -> "uat"
            # (3 unchanged elements hidden)
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getFilteringTerms.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "3724302992510348787" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1747809668795240000" -> "1754386121778750000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-getGenomicVariants.aws_cloudwatch_log_group.lambda[0] will be updated in-place
  ~ resource "aws_cloudwatch_log_group" "lambda" {
        id                = "/aws/lambda/sbeacon-backend-getGenomicVariants"
        name              = "/aws/lambda/sbeacon-backend-getGenomicVariants"
      ~ tags              = {
          ~ "Environment" = "dev" -> "uat"
            "NAME"        = "sbeacon-backend"
            "Owner"       = "gaspi"
        }
      ~ tags_all          = {
          ~ "Environment" = "dev" -> "uat"
            # (2 unchanged elements hidden)
        }
        # (7 unchanged attributes hidden)
    }

  # module.sbeacon.module.lambda-getGenomicVariants.aws_iam_role.lambda[0] will be updated in-place
  ~ resource "aws_iam_role" "lambda" {
        id                    = "sbeacon-backend-getGenomicVariants"
        name                  = "sbeacon-backend-getGenomicVariants"
      ~ tags                  = {
          ~ "Environment" = "dev" -> "uat"
            "NAME"        = "sbeacon-backend"
            "Owner"       = "gaspi"
        }
      ~ tags_all              = {
          ~ "Environment" = "dev" -> "uat"
            # (2 unchanged elements hidden)
        }
        # (11 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getGenomicVariants.aws_iam_role_policy.additional_jsons[0] will be updated in-place
  ~ resource "aws_iam_role_policy" "additional_jsons" {
        id          = "sbeacon-backend-getGenomicVariants:sbeacon-backend-getGenomicVariants-0"
        name        = "sbeacon-backend-getGenomicVariants-0"
      ~ policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "lambda:InvokeFunction"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:lambda:ap-southeast-3:727260606489:function:sbeacon-backend-splitQuery"
                    },
                  - {
                      - Action   = "SNS:Publish"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:sns:ap-southeast-3:727260606489:splitQuery"
                    },
                  - {
                      - Action   = [
                          - "s3:ListBucket",
                          - "s3:GetObject",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.sbeacon.module.lambda-getGenomicVariants.aws_iam_role_policy.additional_jsons[1] will be updated in-place
  ~ resource "aws_iam_role_policy" "additional_jsons" {
        id          = "sbeacon-backend-getGenomicVariants:sbeacon-backend-getGenomicVariants-1"
        name        = "sbeacon-backend-getGenomicVariants-1"
      ~ policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "athena:StartQueryExecution",
                          - "athena:GetQueryResults",
                          - "athena:GetQueryExecution",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:athena:ap-southeast-3:727260606489:workgroup/query_workgroup"
                    },
                  - {
                      - Action   = "glue:*"
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                  - {
                      - Action   = "s3:*"
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:s3:::gaspi-metadata20250521064201492000000003/*",
                          - "arn:aws:s3:::gaspi-metadata20250521064201492000000003",
                        ]
                    },
                  - {
                      - Action   = "dynamodb:Query"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:dynamodb:ap-southeast-3:727260606489:table/sbeacon-dataportal-project-users/index/uid-index"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.sbeacon.module.lambda-getGenomicVariants.aws_iam_role_policy.additional_jsons[2] will be updated in-place
  ~ resource "aws_iam_role_policy" "additional_jsons" {
        id          = "sbeacon-backend-getGenomicVariants:sbeacon-backend-getGenomicVariants-2"
        name        = "sbeacon-backend-getGenomicVariants-2"
      ~ policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "dynamodb:Scan",
                          - "dynamodb:GetItem",
                          - "dynamodb:DescribeTable",
                          - "dynamodb:BatchGetItem",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:dynamodb:ap-southeast-3:727260606489:table/sbeacon-Ontologies",
                          - "arn:aws:dynamodb:ap-southeast-3:727260606489:table/sbeacon-Descendants",
                          - "arn:aws:dynamodb:ap-southeast-3:727260606489:table/sbeacon-Anscestors",
                        ]
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.sbeacon.module.lambda-getGenomicVariants.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getGenomicVariants"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:727260606489:layer:sbeacon_backend_python_libraries_layer:6",
          - "arn:aws:lambda:ap-southeast-3:727260606489:layer:sbeacon_backend_python_modules_layer:5",
        ] -> (known after apply)
      ~ tags                           = {
          ~ "Environment"           = "dev" -> "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
      ~ tags_all                       = {
          ~ "Environment"           = "dev" -> "uat"
            # (3 unchanged elements hidden)
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getGenomicVariants.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "2513497706451832186" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1751931351711692000" -> "1754386121321783000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-getIndividuals.aws_cloudwatch_log_group.lambda[0] will be updated in-place
  ~ resource "aws_cloudwatch_log_group" "lambda" {
        id                = "/aws/lambda/sbeacon-backend-getIndividuals"
        name              = "/aws/lambda/sbeacon-backend-getIndividuals"
      ~ tags              = {
          ~ "Environment" = "dev" -> "uat"
            "NAME"        = "sbeacon-backend"
            "Owner"       = "gaspi"
        }
      ~ tags_all          = {
          ~ "Environment" = "dev" -> "uat"
            # (2 unchanged elements hidden)
        }
        # (7 unchanged attributes hidden)
    }

  # module.sbeacon.module.lambda-getIndividuals.aws_iam_role.lambda[0] will be updated in-place
  ~ resource "aws_iam_role" "lambda" {
        id                    = "sbeacon-backend-getIndividuals"
        name                  = "sbeacon-backend-getIndividuals"
      ~ tags                  = {
          ~ "Environment" = "dev" -> "uat"
            "NAME"        = "sbeacon-backend"
            "Owner"       = "gaspi"
        }
      ~ tags_all              = {
          ~ "Environment" = "dev" -> "uat"
            # (2 unchanged elements hidden)
        }
        # (11 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getIndividuals.aws_iam_role_policy.additional_jsons[0] will be updated in-place
  ~ resource "aws_iam_role_policy" "additional_jsons" {
        id          = "sbeacon-backend-getIndividuals:sbeacon-backend-getIndividuals-0"
        name        = "sbeacon-backend-getIndividuals-0"
      ~ policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "s3:ListBucket",
                          - "s3:GetObject",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                  - {
                      - Action   = "lambda:InvokeFunction"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:lambda:ap-southeast-3:727260606489:function:sbeacon-backend-splitQuery"
                    },
                  - {
                      - Action   = "SNS:Publish"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:sns:ap-southeast-3:727260606489:splitQuery"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.sbeacon.module.lambda-getIndividuals.aws_iam_role_policy.additional_jsons[1] will be updated in-place
  ~ resource "aws_iam_role_policy" "additional_jsons" {
        id          = "sbeacon-backend-getIndividuals:sbeacon-backend-getIndividuals-1"
        name        = "sbeacon-backend-getIndividuals-1"
      ~ policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "athena:StartQueryExecution",
                          - "athena:GetQueryResults",
                          - "athena:GetQueryExecution",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:athena:ap-southeast-3:727260606489:workgroup/query_workgroup"
                    },
                  - {
                      - Action   = "glue:*"
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                  - {
                      - Action   = "s3:*"
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:s3:::gaspi-metadata20250521064201492000000003/*",
                          - "arn:aws:s3:::gaspi-metadata20250521064201492000000003",
                        ]
                    },
                  - {
                      - Action   = "dynamodb:Query"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:dynamodb:ap-southeast-3:727260606489:table/sbeacon-dataportal-project-users/index/uid-index"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.sbeacon.module.lambda-getIndividuals.aws_iam_role_policy.additional_jsons[2] will be updated in-place
  ~ resource "aws_iam_role_policy" "additional_jsons" {
        id          = "sbeacon-backend-getIndividuals:sbeacon-backend-getIndividuals-2"
        name        = "sbeacon-backend-getIndividuals-2"
      ~ policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "dynamodb:Scan",
                          - "dynamodb:GetItem",
                          - "dynamodb:DescribeTable",
                          - "dynamodb:BatchGetItem",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:dynamodb:ap-southeast-3:727260606489:table/sbeacon-Ontologies",
                          - "arn:aws:dynamodb:ap-southeast-3:727260606489:table/sbeacon-Descendants",
                          - "arn:aws:dynamodb:ap-southeast-3:727260606489:table/sbeacon-Anscestors",
                        ]
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.sbeacon.module.lambda-getIndividuals.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getIndividuals"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:727260606489:layer:sbeacon_backend_python_libraries_layer:6",
          - "arn:aws:lambda:ap-southeast-3:727260606489:layer:sbeacon_backend_python_modules_layer:5",
        ] -> (known after apply)
      ~ tags                           = {
          ~ "Environment"           = "dev" -> "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
      ~ tags_all                       = {
          ~ "Environment"           = "dev" -> "uat"
            # (3 unchanged elements hidden)
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getIndividuals.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "556598649862240776" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1751931363691462000" -> "1754386121246383000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-getInfo.aws_cloudwatch_log_group.lambda[0] will be updated in-place
  ~ resource "aws_cloudwatch_log_group" "lambda" {
        id                = "/aws/lambda/sbeacon-backend-getInfo"
        name   
```
</details>
<br>

**Warning**: Output length greater than max comment size. Continued in next comment.